leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxSbcu_bf.h
/** \brief  Length for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBCNTL_Bits.ONBOS3 */
#define IFX_SBCU_DBCNTL_ONBOS3_OFF (31u)

/** \brief  Length for Ifx_SBCU_DBCNTL_Bits.ONG */
#define IFX_SBCU_DBCNTL_ONG_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBCNTL_Bits.ONG */
#define IFX_SBCU_DBCNTL_ONG_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBCNTL_Bits.ONG */
#define IFX_SBCU_DBCNTL_ONG_OFF (16u)

/** \brief  Length for Ifx_SBCU_DBCNTL_Bits.RA */
#define IFX_SBCU_DBCNTL_RA_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBCNTL_Bits.RA */
#define IFX_SBCU_DBCNTL_RA_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBCNTL_Bits.RA */
#define IFX_SBCU_DBCNTL_RA_OFF (4u)

/** \brief  Length for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_LEN (32u)

/** \brief  Mask for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_MSK (0xffffffffu)

/** \brief  Offset for Ifx_SBCU_DBDAT_Bits.FPIDATA */
#define IFX_SBCU_DBDAT_FPIDATA_OFF (0u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.CPU0 */
#define IFX_SBCU_DBGNTT_CPU0_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.CPU0 */
#define IFX_SBCU_DBGNTT_CPU0_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.CPU0 */
#define IFX_SBCU_DBGNTT_CPU0_OFF (7u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.DMACHNR */
#define IFX_SBCU_DBGNTT_DMACHNR_LEN (8u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMACHNR */
#define IFX_SBCU_DBGNTT_DMACHNR_MSK (0xffu)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMACHNR */
#define IFX_SBCU_DBGNTT_DMACHNR_OFF (16u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.DMAH */
#define IFX_SBCU_DBGNTT_DMAH_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMAH */
#define IFX_SBCU_DBGNTT_DMAH_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMAH */
#define IFX_SBCU_DBGNTT_DMAH_OFF (0u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.DMAL */
#define IFX_SBCU_DBGNTT_DMAL_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMAL */
#define IFX_SBCU_DBGNTT_DMAL_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMAL */
#define IFX_SBCU_DBGNTT_DMAL_OFF (15u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.DMAM */
#define IFX_SBCU_DBGNTT_DMAM_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.DMAM */
#define IFX_SBCU_DBGNTT_DMAM_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.DMAM */
#define IFX_SBCU_DBGNTT_DMAM_OFF (5u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.HSMCMI */
#define IFX_SBCU_DBGNTT_HSMCMI_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.HSMCMI */
#define IFX_SBCU_DBGNTT_HSMCMI_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.HSMCMI */
#define IFX_SBCU_DBGNTT_HSMCMI_OFF (13u)

/** \brief  Length for Ifx_SBCU_DBGNTT_Bits.HSMRMI */
#define IFX_SBCU_DBGNTT_HSMRMI_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGNTT_Bits.HSMRMI */
#define IFX_SBCU_DBGNTT_HSMRMI_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGNTT_Bits.HSMRMI */
#define IFX_SBCU_DBGNTT_HSMRMI_OFF (12u)

/** \brief  Length for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGRNT_Bits.CPU0 */
#define IFX_SBCU_DBGRNT_CPU0_OFF (7u)

/** \brief  Length for Ifx_SBCU_DBGRNT_Bits.DMAH */
#define IFX_SBCU_DBGRNT_DMAH_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGRNT_Bits.DMAH */
#define IFX_SBCU_DBGRNT_DMAH_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGRNT_Bits.DMAH */
#define IFX_SBCU_DBGRNT_DMAH_OFF (0u)

/** \brief  Length for Ifx_SBCU_DBGRNT_Bits.DMAL */
#define IFX_SBCU_DBGRNT_DMAL_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGRNT_Bits.DMAL */
#define IFX_SBCU_DBGRNT_DMAL_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGRNT_Bits.DMAL */
#define IFX_SBCU_DBGRNT_DMAL_OFF (15u)

/** \brief  Length for Ifx_SBCU_DBGRNT_Bits.DMAM */
#define IFX_SBCU_DBGRNT_DMAM_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGRNT_Bits.DMAM */
#define IFX_SBCU_DBGRNT_DMAM_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGRNT_Bits.DMAM */
#define IFX_SBCU_DBGRNT_DMAM_OFF (5u)

/** \brief  Length for Ifx_SBCU_DBGRNT_Bits.HSMCMI */
#define IFX_SBCU_DBGRNT_HSMCMI_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGRNT_Bits.HSMCMI */
#define IFX_SBCU_DBGRNT_HSMCMI_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGRNT_Bits.HSMCMI */
#define IFX_SBCU_DBGRNT_HSMCMI_OFF (13u)

/** \brief  Length for Ifx_SBCU_DBGRNT_Bits.HSMRMI */
#define IFX_SBCU_DBGRNT_HSMRMI_LEN (1u)

/** \brief  Mask for Ifx_SBCU_DBGRNT_Bits.HSMRMI */
#define IFX_SBCU_DBGRNT_HSMRMI_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_DBGRNT_Bits.HSMRMI */
#define IFX_SBCU_DBGRNT_HSMRMI_OFF (12u)

/** \brief  Length for Ifx_SBCU_EADD_Bits.FPIADR */
#define IFX_SBCU_EADD_FPIADR_LEN (32u)

/** \brief  Mask for Ifx_SBCU_EADD_Bits.FPIADR */
#define IFX_SBCU_EADD_FPIADR_MSK (0xffffffffu)

/** \brief  Offset for Ifx_SBCU_EADD_Bits.FPIADR */
#define IFX_SBCU_EADD_FPIADR_OFF (0u)

/** \brief  Length for Ifx_SBCU_ECON_Bits.ABT */
#define IFX_SBCU_ECON_ABT_LEN (1u)

/** \brief  Mask for Ifx_SBCU_ECON_Bits.ABT */
#define IFX_SBCU_ECON_ABT_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_ECON_Bits.ABT */
#define IFX_SBCU_ECON_ABT_OFF (16u)

/** \brief  Length for Ifx_SBCU_ECON_Bits.ACK */
#define IFX_SBCU_ECON_ACK_LEN (2u)

/** \brief  Mask for Ifx_SBCU_ECON_Bits.ACK */
#define IFX_SBCU_ECON_ACK_MSK (0x3u)

/** \brief  Offset for Ifx_SBCU_ECON_Bits.ACK */
#define IFX_SBCU_ECON_ACK_OFF (17u)

/** \brief  Length for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_LEN (14u)

/** \brief  Mask for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_MSK (0x3fffu)

/** \brief  Offset for Ifx_SBCU_ECON_Bits.ERRCNT */
#define IFX_SBCU_ECON_ERRCNT_OFF (0u)

/** \brief  Length for Ifx_SBCU_ECON_Bits.OPC */
#define IFX_SBCU_ECON_OPC_LEN (4u)

/** \brief  Mask for Ifx_SBCU_ECON_Bits.OPC */
#define IFX_SBCU_ECON_OPC_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_ECON_Bits.OPC */
#define IFX_SBCU_ECON_OPC_OFF (28u)

/** \brief  Length for Ifx_SBCU_ECON_Bits.RDN */
#define IFX_SBCU_ECON_RDN_LEN (1u)

/** \brief  Mask for Ifx_SBCU_ECON_Bits.RDN */
#define IFX_SBCU_ECON_RDN_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_ECON_Bits.RDN */
#define IFX_SBCU_ECON_RDN_OFF (21u)

