leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxSbcu_bf.h
/** \brief  Length for Ifx_SBCU_ECON_Bits.RDY */
#define IFX_SBCU_ECON_RDY_LEN (1u)

/** \brief  Mask for Ifx_SBCU_ECON_Bits.RDY */
#define IFX_SBCU_ECON_RDY_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_ECON_Bits.RDY */
#define IFX_SBCU_ECON_RDY_OFF (15u)

/** \brief  Length for Ifx_SBCU_ECON_Bits.SVM */
#define IFX_SBCU_ECON_SVM_LEN (1u)

/** \brief  Mask for Ifx_SBCU_ECON_Bits.SVM */
#define IFX_SBCU_ECON_SVM_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_ECON_Bits.SVM */
#define IFX_SBCU_ECON_SVM_OFF (19u)

/** \brief  Length for Ifx_SBCU_ECON_Bits.TAG */
#define IFX_SBCU_ECON_TAG_LEN (6u)

/** \brief  Mask for Ifx_SBCU_ECON_Bits.TAG */
#define IFX_SBCU_ECON_TAG_MSK (0x3fu)

/** \brief  Offset for Ifx_SBCU_ECON_Bits.TAG */
#define IFX_SBCU_ECON_TAG_OFF (22u)

/** \brief  Length for Ifx_SBCU_ECON_Bits.TOUT */
#define IFX_SBCU_ECON_TOUT_LEN (1u)

/** \brief  Mask for Ifx_SBCU_ECON_Bits.TOUT */
#define IFX_SBCU_ECON_TOUT_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_ECON_Bits.TOUT */
#define IFX_SBCU_ECON_TOUT_OFF (14u)

/** \brief  Length for Ifx_SBCU_ECON_Bits.WRN */
#define IFX_SBCU_ECON_WRN_LEN (1u)

/** \brief  Mask for Ifx_SBCU_ECON_Bits.WRN */
#define IFX_SBCU_ECON_WRN_MSK (0x1u)

/** \brief  Offset for Ifx_SBCU_ECON_Bits.WRN */
#define IFX_SBCU_ECON_WRN_OFF (20u)

/** \brief  Length for Ifx_SBCU_EDAT_Bits.FPIDAT */
#define IFX_SBCU_EDAT_FPIDAT_LEN (32u)

/** \brief  Mask for Ifx_SBCU_EDAT_Bits.FPIDAT */
#define IFX_SBCU_EDAT_FPIDAT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_SBCU_EDAT_Bits.FPIDAT */
#define IFX_SBCU_EDAT_FPIDAT_OFF (0u)

/** \brief  Length for Ifx_SBCU_ID_Bits.MODNUMBER */
#define IFX_SBCU_ID_MODNUMBER_LEN (8u)

/** \brief  Mask for Ifx_SBCU_ID_Bits.MODNUMBER */
#define IFX_SBCU_ID_MODNUMBER_MSK (0xffu)

/** \brief  Offset for Ifx_SBCU_ID_Bits.MODNUMBER */
#define IFX_SBCU_ID_MODNUMBER_OFF (8u)

/** \brief  Length for Ifx_SBCU_ID_Bits.MODREV */
#define IFX_SBCU_ID_MODREV_LEN (8u)

/** \brief  Mask for Ifx_SBCU_ID_Bits.MODREV */
#define IFX_SBCU_ID_MODREV_MSK (0xffu)

/** \brief  Offset for Ifx_SBCU_ID_Bits.MODREV */
#define IFX_SBCU_ID_MODREV_OFF (0u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.DMAL */
#define IFX_SBCU_PRIOH_DMAL_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.DMAL */
#define IFX_SBCU_PRIOH_DMAL_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.DMAL */
#define IFX_SBCU_PRIOH_DMAL_OFF (28u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.HSMCMI */
#define IFX_SBCU_PRIOH_HSMCMI_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.HSMCMI */
#define IFX_SBCU_PRIOH_HSMCMI_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.HSMCMI */
#define IFX_SBCU_PRIOH_HSMCMI_OFF (20u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.HSMRMI */
#define IFX_SBCU_PRIOH_HSMRMI_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.HSMRMI */
#define IFX_SBCU_PRIOH_HSMRMI_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.HSMRMI */
#define IFX_SBCU_PRIOH_HSMRMI_OFF (16u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVED8 */
#define IFX_SBCU_PRIOH_RESERVED8_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVED8 */
#define IFX_SBCU_PRIOH_RESERVED8_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVED8 */
#define IFX_SBCU_PRIOH_RESERVED8_OFF (0u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVED9 */
#define IFX_SBCU_PRIOH_RESERVED9_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVED9 */
#define IFX_SBCU_PRIOH_RESERVED9_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVED9 */
#define IFX_SBCU_PRIOH_RESERVED9_OFF (4u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVEDA */
#define IFX_SBCU_PRIOH_RESERVEDA_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVEDA */
#define IFX_SBCU_PRIOH_RESERVEDA_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVEDA */
#define IFX_SBCU_PRIOH_RESERVEDA_OFF (8u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVEDB */
#define IFX_SBCU_PRIOH_RESERVEDB_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVEDB */
#define IFX_SBCU_PRIOH_RESERVEDB_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVEDB */
#define IFX_SBCU_PRIOH_RESERVEDB_OFF (12u)

/** \brief  Length for Ifx_SBCU_PRIOH_Bits.RESERVEDE */
#define IFX_SBCU_PRIOH_RESERVEDE_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOH_Bits.RESERVEDE */
#define IFX_SBCU_PRIOH_RESERVEDE_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOH_Bits.RESERVEDE */
#define IFX_SBCU_PRIOH_RESERVEDE_OFF (24u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.CPU0 */
#define IFX_SBCU_PRIOL_CPU0_OFF (28u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.DMAH */
#define IFX_SBCU_PRIOL_DMAH_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.DMAH */
#define IFX_SBCU_PRIOL_DMAH_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.DMAH */
#define IFX_SBCU_PRIOL_DMAH_OFF (0u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.DMAM */
#define IFX_SBCU_PRIOL_DMAM_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.DMAM */
#define IFX_SBCU_PRIOL_DMAM_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.DMAM */
#define IFX_SBCU_PRIOL_DMAM_OFF (20u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.RESERVED1 */
#define IFX_SBCU_PRIOL_RESERVED1_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.RESERVED1 */
#define IFX_SBCU_PRIOL_RESERVED1_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.RESERVED1 */
#define IFX_SBCU_PRIOL_RESERVED1_OFF (4u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.RESERVED2 */
#define IFX_SBCU_PRIOL_RESERVED2_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.RESERVED2 */
#define IFX_SBCU_PRIOL_RESERVED2_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.RESERVED2 */
#define IFX_SBCU_PRIOL_RESERVED2_OFF (8u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.RESERVED3 */
#define IFX_SBCU_PRIOL_RESERVED3_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.RESERVED3 */
#define IFX_SBCU_PRIOL_RESERVED3_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.RESERVED3 */
#define IFX_SBCU_PRIOL_RESERVED3_OFF (12u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.RESERVED4 */
#define IFX_SBCU_PRIOL_RESERVED4_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.RESERVED4 */
#define IFX_SBCU_PRIOL_RESERVED4_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.RESERVED4 */
#define IFX_SBCU_PRIOL_RESERVED4_OFF (16u)

/** \brief  Length for Ifx_SBCU_PRIOL_Bits.RESERVED6 */
#define IFX_SBCU_PRIOL_RESERVED6_LEN (4u)

/** \brief  Mask for Ifx_SBCU_PRIOL_Bits.RESERVED6 */
#define IFX_SBCU_PRIOL_RESERVED6_MSK (0xfu)

/** \brief  Offset for Ifx_SBCU_PRIOL_Bits.RESERVED6 */
#define IFX_SBCU_PRIOL_RESERVED6_OFF (24u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSBCU_BF_H */
